{
  "basics": {
    "name": "Joan Zara",
    "label": "Student",
    "picture": "img/joan-zara-portrait.jpg",
    "email": "zarajc@hawaii.edu",
    "phone": "808-796-9366",
    "website": "https://jn1za.github.io",
    "summary": "I am studying for a B.S. in Computer Science in the Department of Information and Computer Sciences at the University of Hawaii. I expect to graduate in Spring, 2027.",
    "location": { "address": "", "postalCode": "96822", "city": "Honolulu", "countryCode": "USA", "region": "Hawaii" },
    "profiles": [
      { "network": "github", "username": "jn1za", "url": "http://github.com/jn1za" },
      { "network": "linkedin", "username": "joanzara", "url": "http://linkedin.com/in/joan-zara-99816928b/" }
    ]
  },
  "interests": [
    { "name": "Cybercrime & Threat Intelligence" },
    { "name": "Machine Learning" },
    { "name": "Film & Media" },
    { "name": "Music" },
    { "name": "Foreign Language" }
  ],
  "skills": [
    {
      "name": "Languages and Frameworks",
      "keywords": [ "C", "C++", "Java", "Java", "JavaScript", "TypeScript", "Python", "Linux"]
    },
    {
      "name": "Toolsets/OS",
      "keywords": [ "Windows", "Mint/Kali/Parrot", "Git/GitHub"]
    }
  ],
  "education": [
    {
      "institution": "University of Hawaii, Honolulu, HI",
      "area": "Computer Science (expected Spring, 2018)",
      "studyType": "B.S.",
      "startDate": "2023-08-21",
      "endDate": "Present",
      "courses": [
      ]
    }
  ],
  "work": [
    {
      "company": "Hawaiian Electric Company",
      "position": "Cybersecurity Analyst Intern",
      "website": "",
      "startDate": "2023-06-30",
      "endDate": "Present",
      "summary": "IT Student Assistant in the Network Operations & Security Center",
      "highlights": [
        "Monitor and manage LAN devices and network activity using security tools, and actioning incident response on suspicious or alerted activity.",
        "Create and present daily reports for the CISO regarding projects, intelligence, investigations, and monitor statistics.",
        "Research and report on threat intelligence and hunt for indicators of compromise.",
        "Collaborate with the Risk Management and system owners to mitigate relevant vulnerabilities and confirm the status of potentially vulnerable systems.",
        "Assist with development, testing, and integration of new security solutions and collaborating with OT, Telecom, and Network Infrastructure teams to maximize 24/7 network visibility.",
        "Query and develop apps and dashboards in the SIEM for tailored visibility of security events."
      ]
    },
    {
      "company": "Chuck James Music School",
      "position": "Piano Instructor",
      "website": "",
      "startDate": "2022-07-22",
      "endDate": "Present",
      "summary": "",
      "highlights": [
        "THold lessons one-on-one across a diverse age range, including children, teens, adults, and seniors, with a personalized teaching curriculum in piano technique, music reading and notation, theory, and composition.  ",
        "Maintain communication with students and parents on student progress, objectives and expectations, and performance opportunities. Students have performed at the Hawaii Oktoberfest, Hawaiian Brian's, Blue Note Waikiki, and more.",
        "Guide students in composing original pieces for solo piano, piano accompaniment, and band performances to develop motifs, notate music sheets, and apply music theory principles.",
        "Develop connections with other students and instructors throughout the music school to collaborate among student peers in rehearsals and performances, encompassing a range of piano, voice, guitar, and drum students as bands."
      ]
    }
  ],
  "references": [
    {
      "name": "Available upon request"
    }
  ]
}
